#+TITLE: Config
#+auto_tangle: t

*** Compile buffer Size

#+begin_src emacs-lisp :tangle ./config.el
(defun my-compilation-hook ()
  (when (not (get-buffer-window "*compilation*"))
    (save-selected-window
      (save-excursion
        (let* ((w (split-window-vertically))
               (h (window-height w)))
          (select-window w)
          (switch-to-buffer "*compilation*")
          (shrink-window (- h 10)))))))

(add-hook 'compilation-mode-hook 'my-compilation-hook)

#+end_src

#+RESULTS:
| my-compilation-hook |

